export const HOLIDAY_2024: Holiday[] = [
  {
    date: new Date("2023-12-31T15:00:00.000Z"),
    name: "신정",
    description:
      "새해의 시작을 축하하며 새로운 다짐을 세워보세요. 모든 이에게 희망찬 한 해가 되기를 바랍니다."
  },
  {
    date: new Date("2024-02-08T15:00:00.000Z"),
    name: "설",
    description:
      "가족과 함께 새해를 맞이하며 따뜻한 떡국을 나눠보세요. 새로운 시작과 함께 복 많이 받으세요."
  },
  {
    date: new Date("2024-02-09T15:00:00.000Z"),
    name: "설",
    description:
      "가족과 함께 새해를 맞이하며 따뜻한 떡국을 나눠보세요. 새로운 시작과 함께 복 많이 받으세요."
  },
  {
    date: new Date("2024-02-10T15:00:00.000Z"),
    name: "설",
    description:
      "가족과 함께 새해를 맞이하며 따뜻한 떡국을 나눠보세요. 새로운 시작과 함께 복 많이 받으세요."
  },
  {
    date: new Date("2024-02-11T15:00:00.000Z"),
    name: "대체공휴일",
    description:
      "가족과 함께 새해를 맞이하며 따뜻한 떡국을 나눠보세요. 새로운 시작과 함께 복 많이 받으세요."
  },
  {
    date: new Date("2024-02-29T15:00:00.000Z"),
    name: "삼일절",
    description:
      "우리나라의 독립을 위해 헌신한 분들을 기억하며, 그들의 희생에 감사하는 하루가 되길 바랍니다."
  },
  {
    date: new Date("2024-04-09T15:00:00.000Z"),
    name: "국회의원 선거",
    description:
      "한 표 한 표가 대한민국의 미래를 결정합니다. 소중한 권리를 행사하여 밝은 미래를 만들어보세요."
  },
  {
    date: new Date("2024-04-30T15:00:00.000Z"),
    name: "근로자의 날",
    description:
      "모든 근로자들의 노고를 기리는 날. 충분한 휴식을 취하며 자신을 돌보는 시간을 가져보세요."
  },
  {
    date: new Date("2024-05-04T15:00:00.000Z"),
    name: "어린이 날",
    description:
      "모든 어린이가 행복하게 웃을 수 있는 날. 아이들과 함께 즐거운 추억을 만들어보세요."
  },
  {
    date: new Date("2024-05-05T15:00:00.000Z"),
    name: "대체공휴일",
    description: ""
  },
  {
    date: new Date("2024-05-14T15:00:00.000Z"),
    name: "부처님 오신 날",
    description:
      "부처님의 가르침을 되새기며 마음의 평화를 찾아보세요. 모든 이에게 자비와 사랑이 가득하길 바랍니다."
  },
  {
    date: new Date("2024-06-05T15:00:00.000Z"),
    name: "현충일",
    description:
      "나라를 위해 희생한 분들의 숭고한 정신을 기리는 날. 그들의 희생을 잊지 않고 감사의 마음을 전합니다."
  },
  {
    date: new Date("2024-08-14T15:00:00.000Z"),
    name: "광복절",
    description:
      "우리나라가 광복을 맞이한 기쁨을 함께 나누는 날. 자유와 독립의 소중함을 되새겨보세요."
  },
  {
    date: new Date("2024-09-15T15:00:00.000Z"),
    name: "추석",
    description:
      "한가위 보름달처럼 풍성한 추석이 되길 바랍니다. 가족과 함께 따뜻한 명절 보내세요."
  },
  {
    date: new Date("2024-09-16T15:00:00.000Z"),
    name: "추석",
    description:
      "한가위 보름달처럼 풍성한 추석이 되길 바랍니다. 가족과 함께 따뜻한 명절 보내세요."
  },
  {
    date: new Date("2024-09-17T15:00:00.000Z"),
    name: "추석",
    description:
      "한가위 보름달처럼 풍성한 추석이 되길 바랍니다. 가족과 함께 따뜻한 명절 보내세요."
  },
  {
    date: new Date("2024-10-02T15:00:00.000Z"),
    name: "개천절",
    description:
      "우리 민족의 시작을 기념하는 날. 하늘이 열린 날의 의미를 되새기며 자부심을 느껴보세요."
  },
  {
    date: new Date("2024-10-08T15:00:00.000Z"),
    name: "한글날",
    description:
      "세종대왕께서 훈민정음을 창제한 날을 기념하며, 한글의 아름다움과 소중함을 느껴보세요."
  },
  {
    date: new Date("2024-12-24T15:00:00.000Z"),
    name: "크리스마스",
    description:
      "사랑과 평화의 기쁨이 가득한 크리스마스. 소중한 사람들과 함께 따뜻한 시간을 보내세요."
  }
];
